In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

**concat()**
- axis = 0 : 세로로 합치기
- axis = 1 : 가로로 합치기

In [7]:
df1 = pd.DataFrame({'A' : [1, 2], 'B' : [3, 4]})
df2 = pd.DataFrame({'A' : [10, 11, 12], 'C' : [13, 14, 15]})
df2.drop([1], inplace = True)

display(df1)
display(df2)

   A  B
0  1  3
1  2  4

    A   C
0  10  13
2  12  15

In [8]:
# 세로 합치기 axis = 0
pd.concat([df1, df2], axis = 0, join = 'inner')

    A
0   1
1   2
0  10
2  12

In [9]:
pd.concat([df1, df2], axis = 0, join = 'outer')

    A    B     C
0   1  3.0   NaN
1   2  4.0   NaN
0  10  NaN  13.0
2  12  NaN  15.0

In [10]:
# 가로 합치기 axis = 1
pd.concat([df1, df2], axis = 1, join = 'inner')

   A  B   A   C
0  1  3  10  13

In [12]:
pd.concat([df1, df2], axis = 1, join = 'outer')

     A    B     A     C
0  1.0  3.0  10.0  13.0
1  2.0  4.0   NaN   NaN
2  NaN  NaN  12.0  15.0

**merge()**
- default는 inner join

In [13]:
df1 = pd.DataFrame({'A' : [1, 2], 'B' : [3, 4], 'C' : [5, 6]})
df2 = pd.DataFrame({'A' : [2, 3], 'D' : [7, 8]})

display(df1)
display(df2)

   A  B  C
0  1  3  5
1  2  4  6

   A  D
0  2  7
1  3  8

In [14]:
# inner merge
pd.merge(df1, df2, how = 'inner', on ='A')

   A  B  C  D
0  2  4  6  7

In [16]:
pd.merge(df1, df2, how = 'inner')

   A  B  C  D
0  2  4  6  7

In [17]:
pd.merge(df1, df2, how = 'left')

   A  B  C    D
0  1  3  5  NaN
1  2  4  6  7.0

In [18]:
pd.merge(df1, df2, how = 'right')

   A    B    C  D
0  2  4.0  6.0  7
1  3  NaN  NaN  8

**pivot**
- 집계 후 데이터 프레임 구조를 변형해서 조회한다
- 행 데이터를 열 데이터로 회전시키는 것

In [ ]:
data.pivot(' ', ' ', ' ')